Revit 2017 API
ElectricalSystem Members
The ElectricalSystem type exposes the following members.
Methods
Name | Description
Add
 Add elements into the system and connect them with the system using given connectors.
 (Inherited from MEPSystem.)
AddToCircuit
Add a set of exist components to the Electrical System.
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from Element.)
CanBeHidden
Indicates if the element can be hidden in the view.
 (Inherited from Element.)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from Element.)
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from Element.)
CanHaveTypeAssigned()
 Identifies if the element can have a type assigned.
 (Inherited from Element.)
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from Element.)
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from Element.)
DisconnectPanel
Disconnect the panel for the Electrical System.
Dispose |  (Inherited from Element.)
DivideSystem
 Divide the phyisical networks in the system and create a new system for each network.
 (Inherited from MEPSystem.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from Element.)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from Element.)
GetCriticalPathSectionNumbers
 Obtains a list of the critical path section numbers.
 (Inherited from MEPSystem.)
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from Element.)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from Element.)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from Element.)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from Element.)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from Element.)
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from Element.)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from Element.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from Element.)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from Element.)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from Element.)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from Element.)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from Element.)
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from Element.)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from Element.)
GetParameters
Retrieves the parameters from the element via the given name.
 (Inherited from Element.)
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from Element.)
GetPhysicalNetworksNumber
 Get the physical networks number in the system.
 (Inherited from MEPSystem.)
GetSectionByIndex
 Get the section from the index.
 (Inherited from MEPSystem.)
GetSectionByNumber
 Get the Section from section number
 (Inherited from MEPSystem.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from Element.)
GetValidTypes()
 Obtains a set of types that are valid for this element.
 (Inherited from Element.)
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from Element.)
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from Element.)
IsHidden
Identifies if the element has been permanently hidden in the view.
 (Inherited from Element.)
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from Element.)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from Element.)
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from Element.)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from Element.)
IsSystemDividable
 Checks if the system is dividable. The system is dividable if there is more than one physical network in the system. Currently, only HVAC and piping systems support dividing.
 (Inherited from MEPSystem.)
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from Element.)
LookupParameter
Attempts to find a parameter on the element which has the given name.
 (Inherited from Element.)
NewWires
 Create a bunch of wires for the electrical system.
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from Element.)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from Element.)
Remove(ConnectorSet)
Removes connectors from system.
 (Inherited from MEPSystem.)
Remove(ICollection<ElementId>)
Remove elements from system.
 (Inherited from MEPSystem.)
RemoveFromCircuit
remove a set of exist components from the Electrical System.
SelectPanel
Set the panel for the Electrical System.
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from Element.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ApparentCurrent
Returns the ApparentCurrent value of the Electrical System.
ApparentCurrentPhaseA
Returns the ApparentCurrentPhaseA value of the Electrical System.
ApparentCurrentPhaseB
Returns the ApparentCurrentPhaseB value of the Electrical System.
ApparentCurrentPhaseC
Returns the ApparentCurrentPhaseC value of the Electrical System.
ApparentLoad
Returns the ApparentLoad value of the Electrical System.
ApparentLoadPhaseA
Returns the ApparentLoadPhaseA value of the Electrical System.
ApparentLoadPhaseB
Returns the ApparentLoadPhaseB value of the Electrical System.
ApparentLoadPhaseC
Returns the ApparentLoadPhaseC value of the Electrical System.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BalancedLoad
Reports whether the BalancedLoad is on or off.
BaseEquipment
The base panel or equipment of the system.
 (Inherited from MEPSystem.)
BaseEquipmentConnector
The connector within base equipment which is used to connect with system.
 (Inherited from MEPSystem.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CircuitNumber
Returns the CircuitNumber of the Electrical System.
CircuitType
Get the circuit type of the Electrical System.
ConnectorManager
Connector manager of the system.
 (Inherited from MEPSystem.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Elements
Terminal elements in the system.
 (Inherited from MEPSystem.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroundConductorsNumber
Returns the GroundConductors Number of the Electrical System.
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
HasDesignParts
 Indicates if the system has one or more design parts.
 (Inherited from MEPSystem.)
HasFabricationParts
 Indicates if the system has one or more fabrication parts.
 (Inherited from MEPSystem.)
HasPlaceholders
 Indicates if the system has one or more placeholders.
 (Inherited from MEPSystem.)
HotConductorsNumber
Returns the HotConductors Number of the Electrical System.
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsEmpty
 Indicates if the system is empty or not.
 (Inherited from MEPSystem.)
IsMultipleNetwork
 Indicates if the system is well connected or not. The flag will enable the "Divide System" button.
 (Inherited from MEPSystem.)
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValid
 Indicates if the system is valid or not. atom AtomValidateSystem default false
 (Inherited from MEPSystem.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
Length
Returns the Length value of the Electrical System.
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
LoadClassifications
Returns the LoadClassifications used in the Electrical System.
LoadName
Get/Set the LoadName of the Electrical System.
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Name
Returns the Name of the Electrical System.
 (Overrides Element.Name.)
NeutralConductorsNumber
Returns the NeutralConductors Number of the Electrical System.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
PanelName
Returns the Panel name of the Electrical System.
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
PolesNumber
Returns the Poles Number of the Electrical System.
PowerFactor
Returns the PowerFactor value of the Electrical System.
PowerFactorState
Returns the PowerFactorState type of the Electrical System.
PressureLossOfCriticalPath
 The total pressure loss of the sections in critical path.
 (Inherited from MEPSystem.)
Rating
Get/Set the Rating value of the Electrical System.
RunsNumber
Returns the Runs Number of the Electrical System.
SectionsCount
 The number of sections.
 (Inherited from MEPSystem.)
StartSlot
Get/Set the Start Slot where the Electrical System is located in its panel.
SystemType
Returns the Electrical System Type of the Electrical System.
TrueCurrent
Returns the TrueCurrent value of the Electrical System.
TrueCurrentPhaseA
Returns the TrueCurrentPhaseA value of the Electrical System.
TrueCurrentPhaseB
Returns the TrueCurrentPhaseB value of the Electrical System.
TrueCurrentPhaseC
Returns the TrueCurrentPhaseC value of the Electrical System.
TrueLoad
Returns the TrueLoad value of the Electrical System.
TrueLoadPhaseA
Returns the TrueLoadPhaseA value of the Electrical System.
TrueLoadPhaseB
Returns the TrueLoadPhaseB value of the Electrical System.
TrueLoadPhaseC
Returns the TrueLoadPhaseC value of the Electrical System.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
Voltage
Returns the Voltage value of the Electrical System.
VoltageDrop
Returns the VoltageDrop value of the Electrical System.
WireSizeString
Returns the WireSize as a String of the Electrical System.
WireType
Get/Set the wire type of the Electrical System.
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace